## -*- encoding: utf-8 -*-


# This file was *autogenerated* from the file main-moonmath.sagetex.sage
from sage.all_cmdline import *   # import sage library

_sage_const_58 = Integer(58); _sage_const_0 = Integer(0); _sage_const_69 = Integer(69); _sage_const_87 = Integer(87); _sage_const_1 = Integer(1); _sage_const_90 = Integer(90); _sage_const_159 = Integer(159); _sage_const_2 = Integer(2); _sage_const_164 = Integer(164); _sage_const_175 = Integer(175); _sage_const_3 = Integer(3); _sage_const_179 = Integer(179); _sage_const_193 = Integer(193); _sage_const_4 = Integer(4); _sage_const_196 = Integer(196); _sage_const_259 = Integer(259); _sage_const_5 = Integer(5); _sage_const_261 = Integer(261); _sage_const_343 = Integer(343); _sage_const_6 = Integer(6); _sage_const_350 = Integer(350); _sage_const_379 = Integer(379); _sage_const_7 = Integer(7); _sage_const_382 = Integer(382); _sage_const_454 = Integer(454); _sage_const_8 = Integer(8); _sage_const_456 = Integer(456); _sage_const_534 = Integer(534); _sage_const_9 = Integer(9); _sage_const_538 = Integer(538); _sage_const_604 = Integer(604); _sage_const_10 = Integer(10); _sage_const_606 = Integer(606); _sage_const_652 = Integer(652); _sage_const_11 = Integer(11); _sage_const_657 = Integer(657); _sage_const_721 = Integer(721); _sage_const_12 = Integer(12); _sage_const_734 = Integer(734); _sage_const_756 = Integer(756); _sage_const_13 = Integer(13); _sage_const_765 = Integer(765); _sage_const_785 = Integer(785); _sage_const_14 = Integer(14); _sage_const_791 = Integer(791); _sage_const_802 = Integer(802); _sage_const_15 = Integer(15); _sage_const_807 = Integer(807); _sage_const_843 = Integer(843); _sage_const_16 = Integer(16); _sage_const_849 = Integer(849); _sage_const_863 = Integer(863); _sage_const_17 = Integer(17); _sage_const_869 = Integer(869); _sage_const_922 = Integer(922); _sage_const_18 = Integer(18); _sage_const_929 = Integer(929); _sage_const_957 = Integer(957); _sage_const_19 = Integer(19); _sage_const_961 = Integer(961); _sage_const_981 = Integer(981); _sage_const_20 = Integer(20); _sage_const_986 = Integer(986); _sage_const_1045 = Integer(1045); _sage_const_21 = Integer(21); _sage_const_1049 = Integer(1049); _sage_const_1074 = Integer(1074); _sage_const_22 = Integer(22); _sage_const_1078 = Integer(1078)## This file (main-moonmath.sagetex.sage) was *autogenerated* from main-moonmath.tex with sagetex.sty version 2020/08/12 v3.5.
import sagetex
_st_ = sagetex.SageTeXProcessor('main-moonmath', version='2020/08/12 v3.5', version_check=True)
try:
 _st_.current_tex_line = _sage_const_58 
 _st_.commandline(_sage_const_0 , r"""
sage: ZZ # A sage notation for the integers
sage: NN # A sage notation for the natural numbers
sage: QQ # A sage notation for the rational numbers
sage: ZZ(5) # Get an element from the integers
sage: ZZ(5) + ZZ(3)
sage: ZZ(5) * NN(3)
sage: ZZ.random_element(10**50)
sage: ZZ(27713).str(2) # Binary string representation
sage: NN(27713).str(2) # Binary string representation
sage: ZZ(27713).str(16) # Hexadecimal string representation
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_69 )
try:
 _st_.current_tex_line = _sage_const_87 
 _st_.commandline(_sage_const_1 , r"""
sage: n = NN(504)
sage: factor(n)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_90 )
try:
 _st_.current_tex_line = _sage_const_159 
 _st_.commandline(_sage_const_2 , r"""
sage: ZZ(-17) // ZZ(4) # Integer quotient
sage: ZZ(-17) % ZZ(4) # remainder
sage: ZZ(4).divides(ZZ(-17)) # self divides other
sage: ZZ(4).divides(ZZ(12))
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_164 )
try:
 _st_.current_tex_line = _sage_const_175 
 _st_.commandline(_sage_const_3 , r"""
sage: ZZ(-17) // ZZ(-4) # Integer quotient
sage: ZZ(-17) % ZZ(-4) # remainder
sage: ZZ(-17).quo_rem(ZZ(-4)) # not Euclidean division
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_179 )
try:
 _st_.current_tex_line = _sage_const_193 
 _st_.commandline(_sage_const_4 , r"""
sage: ZZ(143785).quo_rem(ZZ(17))
sage: ZZ(143785) == ZZ(8457)*ZZ(17) + ZZ(16) # check
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_196 )
try:
 _st_.current_tex_line = _sage_const_259 
 _st_.commandline(_sage_const_5 , r"""
sage: ZZ(12).xgcd(ZZ(5)) # (gcd(a,b),s,t)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_261 )
try:
 _st_.current_tex_line = _sage_const_343 
 _st_.commandline(_sage_const_6 , r"""
sage: ZZ(137).gcd(ZZ(64))
sage: ZZ(64)^ ZZ(137) % ZZ(137) == ZZ(64) % ZZ(137)
sage: ZZ(64)^ ZZ(137-1) % ZZ(137) == ZZ(1) % ZZ(137)
sage: ZZ(1918).gcd(ZZ(137))
sage: ZZ(1918)^ ZZ(137) % ZZ(137) == ZZ(1918) % ZZ(137)
sage: ZZ(1918)^ ZZ(137-1) % ZZ(137) == ZZ(1) % ZZ(137)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_350 )
try:
 _st_.current_tex_line = _sage_const_379 
 _st_.commandline(_sage_const_7 , r"""
sage: (ZZ(7)* (ZZ(2)*ZZ(4) + ZZ(21)) + ZZ(11))  % ZZ(6) == (ZZ(4) - ZZ(102))  % ZZ(6)
sage: (ZZ(7)* (ZZ(2)*ZZ(76) + ZZ(21)) + ZZ(11))  % ZZ(6) == (ZZ(76) - ZZ(102))  % ZZ(6)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_382 )
try:
 _st_.current_tex_line = _sage_const_454 
 _st_.commandline(_sage_const_8 , r"""
sage: CRT_list([4,1,3,0], [7,3,5,11])
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_456 )
try:
 _st_.current_tex_line = _sage_const_534 
 _st_.commandline(_sage_const_9 , r"""
sage: Z6 = Integers(6)
sage: Z6(2) + Z6(5)
sage: Z6(7)*(Z6(2)*Z6(4)+Z6(21))+Z6(11) == Z6(4) - Z6(102)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_538 )
try:
 _st_.current_tex_line = _sage_const_604 
 _st_.commandline(_sage_const_10 , r"""
sage: ZZ(6).xgcd(ZZ(5))
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_606 )
try:
 _st_.current_tex_line = _sage_const_652 
 _st_.commandline(_sage_const_11 , r"""
sage: Z5 = Integers(5)
sage: Z5(3)**(5-2)
sage: Z5(3)**(-1)
sage: Z5(3)**(5-2) == Z5(3)**(-1)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_657 )
try:
 _st_.current_tex_line = _sage_const_721 
 _st_.commandline(_sage_const_12 , r"""
sage: Zx = ZZ['x'] # integer polynomials with indeterminate x
sage: Zt.<t> = ZZ[] # integer polynomials with indeterminate t
sage: Zx
sage: Zt
sage: p1 = Zx([17,-4,2])
sage: p1
sage: p1.degree()
sage: p1.leading_coefficient()
sage: p2 = Zt(t^23)
sage: p2
sage: p6 = Zx([0])
sage: p6.degree()
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_734 )
try:
 _st_.current_tex_line = _sage_const_756 
 _st_.commandline(_sage_const_13 , r"""
sage: Z6 = Integers(6)
sage: Z6x = Z6['x']
sage: Z6x
sage: p1 = Z6x([5,-4,2])
sage: p1
sage: p1 = Z6x([17,-4,2])
sage: p1
sage: Z6x(x-2)*Z6x(x+3)*Z6x(x-5) == Z6x(x^3 + 2*x^2 + x)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_765 )
try:
 _st_.current_tex_line = _sage_const_785 
 _st_.commandline(_sage_const_14 , r"""
sage: Zx = ZZ['x']
sage: p1 = Zx([17,-4,2])
sage: p7 = Zx(x-2)*Zx(x+3)*Zx(x-5)
sage: p1(ZZ(2))
sage: p7(ZZ(-6)) == ZZ(-264)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_791 )
try:
 _st_.current_tex_line = _sage_const_802 
 _st_.commandline(_sage_const_15 , r"""
sage: Z6 = Integers(6)
sage: Z6x = Z6['x']
sage: p1 = Z6x([5,-4,2])
sage: p1(Z6(2)) == Z6(5)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_807 )
try:
 _st_.current_tex_line = _sage_const_843 
 _st_.commandline(_sage_const_16 , r"""
sage: Zx = ZZ['x']
sage: P = Zx([2,-4,5])
sage: Q = Zx([5,0,-2,1])
sage: P+Q == Zx(x^3 +3*x^2 -4*x +7)
sage: P*Q == Zx(5*x^5 -14*x^4 +10*x^3+21*x^2-20*x +10)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_849 )
try:
 _st_.current_tex_line = _sage_const_863 
 _st_.commandline(_sage_const_17 , r"""
sage: Z6x = Integers(6)['x']
sage: P = Z6x([2,-4,5])
sage: Q = Z6x([5,0,-2,1])
sage: P+Q == Z6x(x^3 +3*x^2 +2*x +1)
sage: P*Q == Z6x(5*x^5 +4*x^4 +4*x^3+3*x^2+4*x +4)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_869 )
try:
 _st_.current_tex_line = _sage_const_922 
 _st_.commandline(_sage_const_18 , r"""
sage: Zx = ZZ['x']
sage: A = Zx([-9,0,0,2,0,1])
sage: B = Zx([-1,4,1])
sage: Q = Zx([-80,19,-4,1])
sage: P = Zx([-89,339])
sage: A == Q*B + P
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_929 )
try:
 _st_.current_tex_line = _sage_const_957 
 _st_.commandline(_sage_const_19 , r"""
sage: Zx = ZZ['x']
sage: p = Zx(x^2-3)
sage: p.factor()
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_961 )
try:
 _st_.current_tex_line = _sage_const_981 
 _st_.commandline(_sage_const_20 , r"""
sage: Zx = ZZ['x']
sage: p = Zx(x^7 + 3*x^6 + 3*x^5 + x^4 - x^3 - 3*x^2 - 3*x - 1)
sage: p.roots()
sage: p.factor()
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_986 )
try:
 _st_.current_tex_line = _sage_const_1045 
 _st_.commandline(_sage_const_21 , r"""
sage: Qx = QQ['x']
sage: S=[(0,4),(-2,1),(2,3)]
sage: Qx.lagrange_polynomial(S)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_1049 )
try:
 _st_.current_tex_line = _sage_const_1074 
 _st_.commandline(_sage_const_22 , r"""
sage: F5 = GF(5)
sage: F5x = F5['x']
sage: S=[(0,4),(-2,1),(2,3)]
sage: F5x.lagrange_polynomial(S)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_1078 )
_st_.endofdoc()

