## -*- encoding: utf-8 -*-


# This file was *autogenerated* from the file main-moonmath.sagetex.sage
from sage.all_cmdline import *   # import sage library

_sage_const_59 = Integer(59); _sage_const_0 = Integer(0); _sage_const_70 = Integer(70); _sage_const_88 = Integer(88); _sage_const_1 = Integer(1); _sage_const_91 = Integer(91); _sage_const_160 = Integer(160); _sage_const_2 = Integer(2); _sage_const_165 = Integer(165); _sage_const_177 = Integer(177); _sage_const_3 = Integer(3); _sage_const_181 = Integer(181); _sage_const_195 = Integer(195); _sage_const_4 = Integer(4); _sage_const_198 = Integer(198); _sage_const_276 = Integer(276); _sage_const_5 = Integer(5); _sage_const_278 = Integer(278); _sage_const_370 = Integer(370); _sage_const_6 = Integer(6); _sage_const_377 = Integer(377); _sage_const_413 = Integer(413); _sage_const_7 = Integer(7); _sage_const_416 = Integer(416); _sage_const_499 = Integer(499); _sage_const_8 = Integer(8); _sage_const_501 = Integer(501); _sage_const_580 = Integer(580); _sage_const_9 = Integer(9); _sage_const_584 = Integer(584); _sage_const_653 = Integer(653); _sage_const_10 = Integer(10); _sage_const_655 = Integer(655); _sage_const_701 = Integer(701); _sage_const_11 = Integer(11); _sage_const_706 = Integer(706); _sage_const_781 = Integer(781); _sage_const_12 = Integer(12); _sage_const_794 = Integer(794); _sage_const_816 = Integer(816); _sage_const_13 = Integer(13); _sage_const_825 = Integer(825); _sage_const_845 = Integer(845); _sage_const_14 = Integer(14); _sage_const_851 = Integer(851); _sage_const_862 = Integer(862); _sage_const_15 = Integer(15); _sage_const_867 = Integer(867); _sage_const_903 = Integer(903); _sage_const_16 = Integer(16); _sage_const_909 = Integer(909); _sage_const_923 = Integer(923); _sage_const_17 = Integer(17); _sage_const_929 = Integer(929); _sage_const_984 = Integer(984); _sage_const_18 = Integer(18); _sage_const_991 = Integer(991); _sage_const_1022 = Integer(1022); _sage_const_19 = Integer(19); _sage_const_1026 = Integer(1026); _sage_const_1046 = Integer(1046); _sage_const_20 = Integer(20); _sage_const_1051 = Integer(1051); _sage_const_1110 = Integer(1110); _sage_const_21 = Integer(21); _sage_const_1114 = Integer(1114); _sage_const_1139 = Integer(1139); _sage_const_22 = Integer(22); _sage_const_1143 = Integer(1143)## This file (main-moonmath.sagetex.sage) was *autogenerated* from main-moonmath.tex with sagetex.sty version 2020/08/12 v3.5.
import sagetex
_st_ = sagetex.SageTeXProcessor('main-moonmath', version='2020/08/12 v3.5', version_check=True)
try:
 _st_.current_tex_line = _sage_const_59 
 _st_.commandline(_sage_const_0 , r"""
sage: ZZ #  Sage notation for the set of integers
sage: NN # Sage notation for the set of natural numbers
sage: QQ # Sage notation for the set of rational numbers
sage: ZZ(5) # Get an element from the set of integers
sage: ZZ(5) + ZZ(3)
sage: ZZ(5) * NN(3)
sage: ZZ.random_element(10**50)
sage: ZZ(27713).str(2) # Binary string representation
sage: NN(27713).str(2) # Binary string representation
sage: ZZ(27713).str(16) # Hexadecimal string representation
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_70 )
try:
 _st_.current_tex_line = _sage_const_88 
 _st_.commandline(_sage_const_1 , r"""
sage: n = NN(504)
sage: factor(n)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_91 )
try:
 _st_.current_tex_line = _sage_const_160 
 _st_.commandline(_sage_const_2 , r"""
sage: ZZ(-17) // ZZ(4) # Integer quotient
sage: ZZ(-17) % ZZ(4) # remainder
sage: ZZ(4).divides(ZZ(-17)) # self divides other
sage: ZZ(4).divides(ZZ(12))
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_165 )
try:
 _st_.current_tex_line = _sage_const_177 
 _st_.commandline(_sage_const_3 , r"""
sage: ZZ(-17) // ZZ(-4) # Integer quotient
sage: ZZ(-17) % ZZ(-4) # remainder
sage: ZZ(-17).quo_rem(ZZ(-4)) # not Euclidean Division
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_181 )
try:
 _st_.current_tex_line = _sage_const_195 
 _st_.commandline(_sage_const_4 , r"""
sage: ZZ(143785).quo_rem(ZZ(17))
sage: ZZ(143785) == ZZ(8457)*ZZ(17) + ZZ(16) # check
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_198 )
try:
 _st_.current_tex_line = _sage_const_276 
 _st_.commandline(_sage_const_5 , r"""
sage: ZZ(12).xgcd(ZZ(5)) # (gcd(a,b),s,t)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_278 )
try:
 _st_.current_tex_line = _sage_const_370 
 _st_.commandline(_sage_const_6 , r"""
sage: ZZ(137).gcd(ZZ(64))
sage: ZZ(64)^ ZZ(137) % ZZ(137) == ZZ(64) % ZZ(137)
sage: ZZ(64)^ ZZ(137-1) % ZZ(137) == ZZ(1) % ZZ(137)
sage: ZZ(1918).gcd(ZZ(137))
sage: ZZ(1918)^ ZZ(137) % ZZ(137) == ZZ(1918) % ZZ(137)
sage: ZZ(1918)^ ZZ(137-1) % ZZ(137) == ZZ(1) % ZZ(137)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_377 )
try:
 _st_.current_tex_line = _sage_const_413 
 _st_.commandline(_sage_const_7 , r"""
sage: (ZZ(7)* (ZZ(2)*ZZ(4) + ZZ(21)) + ZZ(11))  % ZZ(6) == (ZZ(4) - ZZ(102))  % ZZ(6)
sage: (ZZ(7)* (ZZ(2)*ZZ(76) + ZZ(21)) + ZZ(11))  % ZZ(6) == (ZZ(76) - ZZ(102))  % ZZ(6)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_416 )
try:
 _st_.current_tex_line = _sage_const_499 
 _st_.commandline(_sage_const_8 , r"""
sage: CRT_list([4,1,3,0], [7,3,5,11])
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_501 )
try:
 _st_.current_tex_line = _sage_const_580 
 _st_.commandline(_sage_const_9 , r"""
sage: Z6 = Integers(6)
sage: Z6(2) + Z6(5)
sage: Z6(7)*(Z6(2)*Z6(4)+Z6(21))+Z6(11) == Z6(4) - Z6(102)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_584 )
try:
 _st_.current_tex_line = _sage_const_653 
 _st_.commandline(_sage_const_10 , r"""
sage: ZZ(6).xgcd(ZZ(5))
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_655 )
try:
 _st_.current_tex_line = _sage_const_701 
 _st_.commandline(_sage_const_11 , r"""
sage: Z5 = Integers(5)
sage: Z5(3)**(5-2)
sage: Z5(3)**(-1)
sage: Z5(3)**(5-2) == Z5(3)**(-1)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_706 )
try:
 _st_.current_tex_line = _sage_const_781 
 _st_.commandline(_sage_const_12 , r"""
sage: Zx = ZZ['x'] # integer polynomials with variable x
sage: Zt.<t> = ZZ[] # integer polynomials with variable t
sage: Zx
sage: Zt
sage: p1 = Zx([17,-4,2])
sage: p1
sage: p1.degree()
sage: p1.leading_coefficient()
sage: p2 = Zt(t^23)
sage: p2
sage: p6 = Zx([0])
sage: p6.degree()
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_794 )
try:
 _st_.current_tex_line = _sage_const_816 
 _st_.commandline(_sage_const_13 , r"""
sage: Z6 = Integers(6)
sage: Z6x = Z6['x']
sage: Z6x
sage: p1 = Z6x([5,-4,2])
sage: p1
sage: p1 = Z6x([17,-4,2])
sage: p1
sage: Z6x(x-2)*Z6x(x+3)*Z6x(x-5) == Z6x(x^3 + 2*x^2 + x)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_825 )
try:
 _st_.current_tex_line = _sage_const_845 
 _st_.commandline(_sage_const_14 , r"""
sage: Zx = ZZ['x']
sage: p1 = Zx([17,-4,2])
sage: p7 = Zx(x-2)*Zx(x+3)*Zx(x-5)
sage: p1(ZZ(2))
sage: p7(ZZ(-6)) == ZZ(-264)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_851 )
try:
 _st_.current_tex_line = _sage_const_862 
 _st_.commandline(_sage_const_15 , r"""
sage: Z6 = Integers(6)
sage: Z6x = Z6['x']
sage: p1 = Z6x([5,-4,2])
sage: p1(Z6(2)) == Z6(5)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_867 )
try:
 _st_.current_tex_line = _sage_const_903 
 _st_.commandline(_sage_const_16 , r"""
sage: Zx = ZZ['x']
sage: P = Zx([2,-4,5])
sage: Q = Zx([5,0,-2,1])
sage: P+Q == Zx(x^3 +3*x^2 -4*x +7)
sage: P*Q == Zx(5*x^5 -14*x^4 +10*x^3+21*x^2-20*x +10)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_909 )
try:
 _st_.current_tex_line = _sage_const_923 
 _st_.commandline(_sage_const_17 , r"""
sage: Z6x = Integers(6)['x']
sage: P = Z6x([2,-4,5])
sage: Q = Z6x([5,0,-2,1])
sage: P+Q == Z6x(x^3 +3*x^2 +2*x +1)
sage: P*Q == Z6x(5*x^5 +4*x^4 +4*x^3+3*x^2+4*x +4)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_929 )
try:
 _st_.current_tex_line = _sage_const_984 
 _st_.commandline(_sage_const_18 , r"""
sage: Zx = ZZ['x']
sage: A = Zx([-9,0,0,2,0,1])
sage: B = Zx([-1,4,1])
sage: Q = Zx([-80,19,-4,1])
sage: P = Zx([-89,339])
sage: A == Q*B + P
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_991 )
try:
 _st_.current_tex_line = _sage_const_1022 
 _st_.commandline(_sage_const_19 , r"""
sage: Zx = ZZ['x']
sage: p = Zx(x^2-3)
sage: p.factor()
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_1026 )
try:
 _st_.current_tex_line = _sage_const_1046 
 _st_.commandline(_sage_const_20 , r"""
sage: Zx = ZZ['x']
sage: p = Zx(x^7 + 3*x^6 + 3*x^5 + x^4 - x^3 - 3*x^2 - 3*x - 1)
sage: p.roots()
sage: p.factor()
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_1051 )
try:
 _st_.current_tex_line = _sage_const_1110 
 _st_.commandline(_sage_const_21 , r"""
sage: Qx = QQ['x']
sage: S=[(0,4),(-2,1),(2,3)]
sage: Qx.lagrange_polynomial(S)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_1114 )
try:
 _st_.current_tex_line = _sage_const_1139 
 _st_.commandline(_sage_const_22 , r"""
sage: F5 = GF(5)
sage: F5x = F5['x']
sage: S=[(0,4),(-2,1),(2,3)]
sage: F5x.lagrange_polynomial(S)
""", globals(), locals(), True)
except:
 _st_.goboom(_sage_const_1143 )
_st_.endofdoc()

